#  Chapter 2 - pandas
Prepared by Dr. N. Ali Saoucha Associate Professor A University of Algiers (nalisaoucha@gmail.com)

In [1]:
#Importing the pandas Library
import pandas as pd

# Creating a pandas Series

In [2]:
list1 = [1, 2, 3, 4, 5]
print(list1, end='\n\n')
series1 = pd.Series(list1)
print(series1, end='\n\n')
series2 = pd.Series(list1, index=['P', 'Q', 'R', 'S', 'T'])
print(series2, end='\n\n')

[1, 2, 3, 4, 5]

0    1
1    2
2    3
3    4
4    5
dtype: int64

P    1
Q    2
R    3
S    4
T    5
dtype: int64

# Creating a pandas DataFrame

In [3]:
# Creating from a 2D list
myList = [[1, 2, 3], [4, 5, 6]]
df1 = pd.DataFrame(myList)
print(df1, end='\n\n')
# Creating from a dictionary of lists
myDict = {'A':[1, 2, 3], 'B':[4, 5, 6]}
df2 = pd.DataFrame(myDict)
print(df2, end='\n\n')

   0  1  2
0  1  2  3
1  4  5  6

   A  B
0  1  4
1  2  5
2  3  6

In [4]:
myList2 = [[1, 2, 3, 4, 5], [10, 20, 30, 40, 50]]
df3 = pd.DataFrame(myList2, index = ['A', 'B'], columns = ['1st', '2nd', '3rd', '4th', '5th'])
df3

   1st  2nd  3rd  4th  5th
A    1    2    3    4    5
B   10   20   30   40   50

# Using read_csv()

In [5]:
classData = pd.read_csv('Chap3Demo.csv')

# Accessing data in DataFrame

In [6]:
classData.head(6)

  ModuleID Instructor          TA  Enrolment  Rating
0       ML      Ahmed     Yasmine         35       8
1       ML      Leila       Karim         38       7
2       ML    Mohamed        Omar         30       6
3       PA     Fatima  Abdelkader         40       7
4       PA      Amine     Yasmine         36       8
5       PA      Leila      Fatima         34       6

In [7]:
classData.describe()

       Enrolment     Rating
count  11.000000  11.000000
mean   35.818182   7.363636
std     4.423080   0.924416
min    30.000000   6.000000
25%    32.500000   7.000000
50%    35.000000   7.000000
75%    39.000000   8.000000
max    43.000000   9.000000

# Modifying Row and Column Labels

In [8]:
classData = classData.rename(columns={'TA':'Assistant'}, index={0:'Row Zero',1:'Row One', 9:'13', 5: 4})
classData

         ModuleID  Instructor   Assistant  Enrolment  Rating
Row Zero       ML       Ahmed     Yasmine         35       8
Row One        ML       Leila       Karim         38       7
2              ML     Mohamed        Omar         30       6
3              PA      Fatima  Abdelkader         40       7
4              PA       Amine     Yasmine         36       8
4              PA       Leila      Fatima         34       6
6              OC       Karim       Walid         42       7
7              OC       Sarah     Yasmina         43       8
8              OC      Nassim      Fatima         32       7
13             ML  Abdelkader       Leila         33       9
10             ML      Fatima     Mohamed         31       8

# Data Extraction from a DataFrame

## Selecting Columns

In [9]:
X1 = classData['ModuleID']
print(X1)
print(type(X1))

Row Zero    ML
Row One     ML
2           ML
3           PA
4           PA
4           PA
6           OC
7           OC
8           OC
13          ML
10          ML
Name: ModuleID, dtype: object
<class 'pandas.core.series.Series'>

In [11]:
X2 = classData[['ModuleID']]
X3 = classData[['ModuleID', 'Instructor']]
print(type(X2))
print((X2))
print(type(X3))
print((X3))

<class 'pandas.core.frame.DataFrame'>
         ModuleID
Row Zero       ML
Row One        ML
2              ML
3              PA
4              PA
4              PA
6              OC
7              OC
8              OC
13             ML
10             ML
<class 'pandas.core.frame.DataFrame'>
         ModuleID  Instructor
Row Zero       ML       Ahmed
Row One        ML       Leila
2              ML     Mohamed
3              PA      Fatima
4              PA       Amine
4              PA       Leila
6              OC       Karim
7              OC       Sarah
8              OC      Nassim
13             ML  Abdelkader
10             ML      Fatima

## Selecting Rows

### Using Boolean Arrays

In [12]:
arr1 = classData['ModuleID'] == 'CS101'
print(arr1)
classData[arr1]

Row Zero    False
Row One     False
2           False
3           False
4           False
4           False
6           False
7           False
8           False
13          False
10          False
Name: ModuleID, dtype: bool

Empty DataFrame
Columns: [ModuleID, Instructor, Assistant, Enrolment, Rating]
Index: []

In [13]:
arr1 = classData['ModuleID'] == 'CS101'
arr2 = classData['Instructor'] == 'Aaron'
classData[arr1 & arr2]

Empty DataFrame
Columns: [ModuleID, Instructor, Assistant, Enrolment, Rating]
Index: []

In [14]:
classData[(classData['ModuleID'] == 'CS101') & (classData['Instructor'] == 'Aaron')]

Empty DataFrame
Columns: [ModuleID, Instructor, Assistant, Enrolment, Rating]
Index: []

## iloc[] and loc[]

In [15]:
classData

         ModuleID  Instructor   Assistant  Enrolment  Rating
Row Zero       ML       Ahmed     Yasmine         35       8
Row One        ML       Leila       Karim         38       7
2              ML     Mohamed        Omar         30       6
3              PA      Fatima  Abdelkader         40       7
4              PA       Amine     Yasmine         36       8
4              PA       Leila      Fatima         34       6
6              OC       Karim       Walid         42       7
7              OC       Sarah     Yasmina         43       8
8              OC      Nassim      Fatima         32       7
13             ML  Abdelkader       Leila         33       9
10             ML      Fatima     Mohamed         31       8

In [16]:
print(classData.loc[4])

  ModuleID Instructor Assistant  Enrolment  Rating
4       PA      Amine   Yasmine         36       8
4       PA      Leila    Fatima         34       6

In [17]:
print(classData.iloc[4])
print(type(classData.iloc[4]))

ModuleID           PA
Instructor      Amine
Assistant     Yasmine
Enrolment          36
Rating              8
Name: 4, dtype: object
<class 'pandas.core.series.Series'>

In [18]:
print(classData.loc['Row Zero'])
print(type(classData.loc['Row Zero']))

ModuleID           ML
Instructor      Ahmed
Assistant     Yasmine
Enrolment          35
Rating              8
Name: Row Zero, dtype: object
<class 'pandas.core.series.Series'>

In [19]:
print(classData.iloc[[0]])
print(type(classData.iloc[[0]]))

         ModuleID Instructor Assistant  Enrolment  Rating
Row Zero       ML      Ahmed   Yasmine         35       8
<class 'pandas.core.frame.DataFrame'>

In [20]:
print(classData.loc[['Row Zero']])
print(type(classData.loc[['Row Zero']]))

         ModuleID Instructor Assistant  Enrolment  Rating
Row Zero       ML      Ahmed   Yasmine         35       8
<class 'pandas.core.frame.DataFrame'>

In [21]:
print(classData.iloc[[0, 3, 4]])
print(type(classData.iloc[[0, 3, 4]]))

         ModuleID Instructor   Assistant  Enrolment  Rating
Row Zero       ML      Ahmed     Yasmine         35       8
3              PA     Fatima  Abdelkader         40       7
4              PA      Amine     Yasmine         36       8
<class 'pandas.core.frame.DataFrame'>

In [22]:
print(classData)
print(classData.loc[['Row Zero', 3 , 10]])
print(type(classData.loc[['Row Zero', 3, 10]]))

         ModuleID  Instructor   Assistant  Enrolment  Rating
Row Zero       ML       Ahmed     Yasmine         35       8
Row One        ML       Leila       Karim         38       7
2              ML     Mohamed        Omar         30       6
3              PA      Fatima  Abdelkader         40       7
4              PA       Amine     Yasmine         36       8
4              PA       Leila      Fatima         34       6
6              OC       Karim       Walid         42       7
7              OC       Sarah     Yasmina         43       8
8              OC      Nassim      Fatima         32       7
13             ML  Abdelkader       Leila         33       9
10             ML      Fatima     Mohamed         31       8
         ModuleID Instructor   Assistant  Enrolment  Rating
Row Zero       ML      Ahmed     Yasmine         35       8
3              PA     Fatima  Abdelkader         40       7
10             ML     Fatima     Mohamed         31       8
<class 'pandas.core.frame.DataFrame'>

In [23]:
print(classData.iloc[0:3])
print(type(classData.iloc[0:3]))

         ModuleID Instructor Assistant  Enrolment  Rating
Row Zero       ML      Ahmed   Yasmine         35       8
Row One        ML      Leila     Karim         38       7
2              ML    Mohamed      Omar         30       6
<class 'pandas.core.frame.DataFrame'>

In [24]:
print(classData.iloc[0:1])
print(type(classData.iloc[0:1]))

         ModuleID Instructor Assistant  Enrolment  Rating
Row Zero       ML      Ahmed   Yasmine         35       8
<class 'pandas.core.frame.DataFrame'>

# Updating a DataFrame

In [25]:
#print(classData)
classData['AverageGPA'] = [44, 46, 47, 41, 45, 49, 40, 41, 45, 48, 42]
print(classData)
classData['AverageGPA'] = classData['AverageGPA']*0.1
print(classData)

         ModuleID  Instructor   Assistant  Enrolment  Rating  AverageGPA
Row Zero       ML       Ahmed     Yasmine         35       8          44
Row One        ML       Leila       Karim         38       7          46
2              ML     Mohamed        Omar         30       6          47
3              PA      Fatima  Abdelkader         40       7          41
4              PA       Amine     Yasmine         36       8          45
4              PA       Leila      Fatima         34       6          49
6              OC       Karim       Walid         42       7          40
7              OC       Sarah     Yasmina         43       8          41
8              OC      Nassim      Fatima         32       7          45
13             ML  Abdelkader       Leila         33       9          48
10             ML      Fatima     Mohamed         31       8          42
         ModuleID  Instructor   Assistant  Enrolment  Rating  AverageGPA
Row Zero       ML       Ahmed     Yasmine         35       8         4.4
Row One        ML       Leila       Karim         38       7         4.6
2              ML     Mohamed        Omar         30       6         4.7
3              PA      Fatima  Abdelkader         40       7         4.1
4              PA       Amine     Yasmine         36       8         4.5
4              PA       Leila      Fatima         34       6         4.9
6              OC       Karim       Walid         42       7         4.0
7              OC       Sarah     Yasmina         43       8         4.1
8              OC      Nassim      Fatima         32       7         4.5
13             ML  Abdelkader       Leila         33       9         4.8
10             ML      Fatima     Mohamed         31       8         4.2

# Useful Methods in pandas

## sort_values()

In [26]:
print(classData)
sorted = classData.sort_values(['Rating', 'AverageGPA'], ascending=False)
print(sorted)

         ModuleID  Instructor   Assistant  Enrolment  Rating  AverageGPA
Row Zero       ML       Ahmed     Yasmine         35       8         4.4
Row One        ML       Leila       Karim         38       7         4.6
2              ML     Mohamed        Omar         30       6         4.7
3              PA      Fatima  Abdelkader         40       7         4.1
4              PA       Amine     Yasmine         36       8         4.5
4              PA       Leila      Fatima         34       6         4.9
6              OC       Karim       Walid         42       7         4.0
7              OC       Sarah     Yasmina         43       8         4.1
8              OC      Nassim      Fatima         32       7         4.5
13             ML  Abdelkader       Leila         33       9         4.8
10             ML      Fatima     Mohamed         31       8         4.2
         ModuleID  Instructor   Assistant  Enrolment  Rating  AverageGPA
13             ML  Abdelkader       Leila         33       9         4.8
4              PA       Amine     Yasmine         36       8         4.5
Row Zero       ML       Ahmed     Yasmine         35       8         4.4
10             ML      Fatima     Mohamed         31       8         4.2
7              OC       Sarah     Yasmina         43       8         4.1
Row One        ML       Leila       Karim         38       7         4.6
8              OC      Nassim      Fatima         32       7         4.5
3              PA      Fatima  Abdelkader         40       7         4.1
6              OC       Karim       Walid         42       7         4.0
4              PA       Leila      Fatima         34       6         4.9
2              ML     Mohamed        Omar         30       6         4.7

## isnull()

* In the realm of pandas, missing values encompass both the None keyword (without quotes) and the NumPy NaN value (including nan and NAN variants). 
* Conversely, an empty string (' '), the string 'None', and the numeric zero are not categorized as missing values.

In [27]:
import numpy as np
myData = pd.DataFrame([[None], [np.NaN], [''], ['Apple']], columns = ['A'])
print(myData.isnull())
print(myData.isnull().sum())
print(classData.isnull().sum())

       A
0   True
1   True
2  False
3  False
A    2
dtype: int64
ModuleID      0
Instructor    0
Assistant     0
Enrolment     0
Rating        0
AverageGPA    0
dtype: int64

## dropna()

In [28]:
classData_rows_deleted = classData.dropna()
classData_columns_deleted  = classData.dropna(axis=1)
print(classData)
print(classData_rows_deleted)
print(classData_columns_deleted)

         ModuleID  Instructor   Assistant  Enrolment  Rating  AverageGPA
Row Zero       ML       Ahmed     Yasmine         35       8         4.4
Row One        ML       Leila       Karim         38       7         4.6
2              ML     Mohamed        Omar         30       6         4.7
3              PA      Fatima  Abdelkader         40       7         4.1
4              PA       Amine     Yasmine         36       8         4.5
4              PA       Leila      Fatima         34       6         4.9
6              OC       Karim       Walid         42       7         4.0
7              OC       Sarah     Yasmina         43       8         4.1
8              OC      Nassim      Fatima         32       7         4.5
13             ML  Abdelkader       Leila         33       9         4.8
10             ML      Fatima     Mohamed         31       8         4.2
         ModuleID  Instructor   Assistant  Enrolment  Rating  AverageGPA
Row Zero       ML       Ahmed     Yasmine         35       8         4.4
Row One        ML       Leila       Karim         38       7         4.6
2              ML     Mohamed        Omar         30       6         4.7
3              PA      Fatima  Abdelkader         40       7         4.1
4              PA       Amine     Yasmine         36       8         4.5
4              PA       Leila      Fatima         34       6         4.9
6              OC       Karim       Walid         42       7         4.0
7              OC       Sarah     Yasmina         43       8         4.1
8              OC      Nassim      Fatima         32       7         4.5
13             ML  Abdelkader       Leila         33       9         4.8
10             ML      Fatima     Mohamed         31       8         4.2
         ModuleID  Instructor   Assistant  Enrolment  Rating  AverageGPA
Row Zero       ML       Ahmed     Yasmine         35       8         4.4
Row One        ML       Leila       Karim         38       7         4.6
2              ML     Mohamed        Omar         30       6         4.7
3              PA      Fatima  Abdelkader         40       7         4.1
4              PA       Amine     Yasmine         36       8         4.5
4              PA       Leila      Fatima         34       6         4.9
6              OC       Karim       Walid         42       7         4.0
7              OC       Sarah     Yasmina         43       8         4.1
8              OC      Nassim      Fatima         32       7         4.5
13             ML  Abdelkader       Leila         33       9         4.8
10             ML      Fatima     Mohamed         31       8         4.2

## to_numpy()

In [34]:
myData2 = pd.DataFrame([[1, 2], [3, 4]], columns = ['A', 'B'])
myArr = myData2.to_numpy()
print(type(myData2))
print(myData2)
print(type(myArr))
print(myArr)

<class 'pandas.core.frame.DataFrame'>
   A  B
0  1  2
1  3  4
<class 'numpy.ndarray'>
[[1 2]
 [3 4]]

## corr()

In [29]:
myData3 = pd.DataFrame({'A':[1, 4, 7, 10], 'B':[1, 2, 3, 4], 'C':[2, 12, 1, 5]})
print(myData3)
myData3.corr()

    A  B   C
0   1  1   2
1   4  2  12
2   7  3   1
3  10  4   5

          A         B         C
A  1.000000  1.000000 -0.051988
B  1.000000  1.000000 -0.051988
C -0.051988 -0.051988  1.000000